tap "homebrew/bundle"
brew "poetry"
brew "pyenv"
cask "appcleaner"
cask "iterm2"
cask "visual-studio-code"
cask "zoom"
vscode "1yib.rust-bundle"
vscode "alexcvzz.vscode-sqlite"
vscode "antfu.browse-lite"
vscode "aprilandjan.ascii-tree-generator"
vscode "batisteo.vscode-django"
vscode "compulim.vscode-clock"
vscode "cristianadamo.mojo"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dustypomerleau.rust-syntax"
vscode "ecmel.vscode-html-css"
vscode "game-development-department.bongocat-mollu"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hediet.vscode-drawio"
vscode "josef.rouge-theme"
vscode "kevinrose.vsc-python-indent"
vscode "luke-zhang-04.processing-vscode"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "millenniumambiguity.processing-formatter"
vscode "modular-mojotools.vscode-mojo"
vscode "mojo-lang.mojo-lang"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "oracle.oracle-java"
vscode "pixl-garden.bongocat"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "tobiah.language-pde"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wakatime.vscode-wakatime"
vscode "wholroyd.jinja"
vscode "yzane.markdown-pdf"
vscode "zakudriver.nyan-mode"
vscode "zeshuaro.vscode-python-poetry"
vscode "zhang-renyang.vscode-react"
